In [1]:
import pandas as pd 
data = pd.read_csv('New_sales.csv')
data

,Unnamed: 0,State,Total_Expenses,Sales,Profit,Market,Trade,Product_Type,Inventory,Type,New_Column
0,0,California,63.0,109.0,-131.0,West,40,Coffee,2947.0,Regular,172.0
1,1,California,55.0,201.0,88.0,West,24,Tea,659.0,Regular,256.0
2,2,California,700.0,289.0,25.0,West,109,Espresso,788.0,Regular,989.0
3,3,California,113.0,576.0,216.0,West,81,Espresso,1744.0,Decaf,689.0
4,4,California,37.0,247.0,148.0,West,26,Herbal Tea,809.0,Decaf,284.0
...,...,...,...,...,...,...,...,...,...,...,...
4224,4236,Wisconsin,34.0,90.0,20.0,Central,11,Tea,458.0,Regular,124.0
4225,4237,Wisconsin,36.0,113.0,31.0,Central,14,Tea,454.0,Regular,149.0
4226,4238,Wisconsin,86.0,150.0,1.0,Central,57,Tea,506.0,Regular,236.0
4227,4239,Wisconsin,79.0,131.0,-3.0,Central,49,Tea,627.0,Regular,210.0
4228,4240,Wisconsin,87.0,165.0,4.0,Central,58,Tea,513.0,Regular,252.0

In [3]:
data.shape

(4229, 11)

# Pandas Data Frames and series

In [4]:
type(data)

pandas.core.frame.DataFrame

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4229 entries, 0 to 4228
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      4229 non-null   int64
 1   State           4229 non-null   object
 2   Total_Expenses  4229 non-null   float64
 3   Sales           4229 non-null   float64
 4   Profit          4229 non-null   float64
 5   Market          4229 non-null   object
 6   Trade           4229 non-null   int64
 7   Product_Type    4229 non-null   object
 8   Inventory       4229 non-null   float64
 9   Type            4229 non-null   object
 10  New_Column      4229 non-null   float64
dtypes: float64(5), int64(2), object(4)
memory usage: 363.6+ KB

In [7]:
data.describe()

,Unnamed: 0,Total_Expenses,Sales,Profit,Trade,Inventory,New_Column
count,4229.000000,4229.000000,4229.000000,4229.000000,4229.000000,4229.000000,4229.000000
mean,2125.081343,54.102152,192.298416,60.765666,31.104280,747.253724,246.400568
std,1222.373708,33.746537,150.330235,101.348158,26.986835,660.544773,174.436784
min,0.000000,10.000000,17.000000,-638.000000,0.000000,-3534.000000,38.000000
25%,1069.000000,33.000000,100.000000,17.000000,13.000000,430.000000,138.000000
50%,2126.000000,46.000000,137.000000,40.000000,22.000000,619.000000,190.000000
75%,3183.000000,65.000000,230.000000,91.000000,39.000000,898.000000,285.000000
max,4240.000000,700.000000,912.000000,778.000000,156.000000,8252.000000,1090.000000

# Converting List into Dataframe

In [12]:
insects = ['Ants', 'Crickets', 'Bees', 'Grasshopper']
columns = ["Insects"]
type(insects)

list

In [14]:
data_insects = pd.DataFrame(insects, columns=columns)
data_insects

       Insects
0         Ants
1     Crickets
2         Bees
3  Grasshopper

In [15]:
type(data_insects)

pandas.core.frame.DataFrame

In [19]:
animals = {'Mammals':['Cat','Dog','Sheep'],
           'Birds':['Crow', 'Sparrow', 'Eagle'],
           'Reptiles':['Crockodile', 'Lizard', 'Snake'],
           'Insects': ['Ants', 'Crickets', 'Bees']}

data_animals = pd.DataFrame(animals)

data_animals

  Mammals    Birds    Reptiles   Insects
0     Cat     Crow  Crockodile      Ants
1     Dog  Sparrow      Lizard  Crickets
2   Sheep    Eagle       Snake      Bees

In [20]:
data_animals['Mammals']

0      Cat
1      Dog
2    Sheep
Name: Mammals, dtype: object

In [21]:
data_animals['Birds']

0       Crow
1    Sparrow
2      Eagle
Name: Birds, dtype: object

In [22]:
data_animals.Reptiles

0    Crockodile
1        Lizard
2         Snake
Name: Reptiles, dtype: object

In [23]:
type(data_animals.Reptiles)

pandas.core.series.Series

In [26]:
data_animals.iloc[0]

Mammals            Cat
Birds             Crow
Reptiles    Crockodile
Insects           Ants
Name: 0, dtype: object

In [27]:
data_animals.iloc[1]

Mammals          Dog
Birds        Sparrow
Reptiles      Lizard
Insects     Crickets
Name: 1, dtype: object

In [28]:
type(data_animals.iloc[1])

pandas.core.series.Series

In [31]:
data_animals.iloc[[0,2]]

  Mammals  Birds    Reptiles Insects
0     Cat   Crow  Crockodile    Ants
2   Sheep  Eagle       Snake    Bees